# მოცემული 3 მთელი a,b,c̸=0 რიცხვებისთვის მოძებნეთ a და
# b რიცხვებს შორის მოხვედრილი c რიცხვის ჯერადი რიცხვების
# რაოდენობა ყველა შესაძლო ვარიანტისთვის. თუ რომელიმე
# a,b-დან ჯერადია c-ს, მაშინ ჩათვალეთ შესაბამისი საზღვარი.
# მოიფიქრეთ ამოცანის ამოხსნის ალგორითმი, დაწერეთ და გა-
# უშვით პროგრამა ციკლის და რეკურსიის (აგრეთვე range) კონ-
# სტრუქციის გამოყენების გარეშე

a = 4
b = 10
c = 2

MIN = a - (a % c) +c
MAX = b - (b % c)

print((MAX-MIN)/c+1)

def problem1 (a,b,c):
    return (((b-(b%c))-(a-(a%c)+c))/c)+1

